keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_bf.h
/** \\brief  Length for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_OFF (19)

/** \\brief  Length for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_OFF (27)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_OFF (3)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_OFF (11)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_OFF (19)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_OFF (27)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_OFF (3)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_OFF (11)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_OFF (19)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_OFF (27)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_OFF (19)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_OFF (27)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_OFF (3)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_LEN (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_MSK (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_OFF (11)

/** \\brief  Length for Ifx_P_LPCR0_P21_Bits.LRXTERM */
#define IFX_P_LPCR0_P21_LRXTERM_LEN (5)

/** \\brief  Mask for Ifx_P_LPCR0_P21_Bits.LRXTERM */
#define IFX_P_LPCR0_P21_LRXTERM_MSK (0x1f)

/** \\brief  Offset for Ifx_P_LPCR0_P21_Bits.LRXTERM */
#define IFX_P_LPCR0_P21_LRXTERM_OFF (3)

/** \\brief  Length for Ifx_P_LPCR0_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR0_P21_RDIS_CTRL_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR0_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR0_P21_RDIS_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR0_P21_RDIS_CTRL_OFF (0)

/** \\brief  Length for Ifx_P_LPCR0_P21_Bits.RX_DIS */
#define IFX_P_LPCR0_P21_RX_DIS_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR0_P21_Bits.RX_DIS */
#define IFX_P_LPCR0_P21_RX_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_P21_Bits.RX_DIS */
#define IFX_P_LPCR0_P21_RX_DIS_OFF (1)

/** \\brief  Length for Ifx_P_LPCR0_P21_Bits.TERM */
#define IFX_P_LPCR0_P21_TERM_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR0_P21_Bits.TERM */
#define IFX_P_LPCR0_P21_TERM_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_P21_Bits.TERM */
#define IFX_P_LPCR0_P21_TERM_OFF (2)

/** \\brief  Length for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_OFF (1)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_LEN (5)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_MSK (0x1f)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_OFF (3)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_OFF (0)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_OFF (1)

/** \\brief  Length for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_LEN (1)

/** \\brief  Mask for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_MSK (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_OFF (2)

/** \\brief  Length for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_LEN (1)

