keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_bf.h
/** \\brief  Length for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_OFF (11)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_OFF (1)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_OFF (2)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_OFF (3)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_OFF (4)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_OFF (5)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_LEN (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_MSK (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_OFF (6)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS0 */
#define IFX_P_PDISC_PDIS0_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS0 */
#define IFX_P_PDISC_PDIS0_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS0 */
#define IFX_P_PDISC_PDIS0_OFF (0)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS10 */
#define IFX_P_PDISC_PDIS10_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS10 */
#define IFX_P_PDISC_PDIS10_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS10 */
#define IFX_P_PDISC_PDIS10_OFF (10)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS11 */
#define IFX_P_PDISC_PDIS11_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS11 */
#define IFX_P_PDISC_PDIS11_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS11 */
#define IFX_P_PDISC_PDIS11_OFF (11)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS12 */
#define IFX_P_PDISC_PDIS12_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS12 */
#define IFX_P_PDISC_PDIS12_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS12 */
#define IFX_P_PDISC_PDIS12_OFF (12)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS13 */
#define IFX_P_PDISC_PDIS13_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS13 */
#define IFX_P_PDISC_PDIS13_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS13 */
#define IFX_P_PDISC_PDIS13_OFF (13)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS14 */
#define IFX_P_PDISC_PDIS14_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS14 */
#define IFX_P_PDISC_PDIS14_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS14 */
#define IFX_P_PDISC_PDIS14_OFF (14)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS15 */
#define IFX_P_PDISC_PDIS15_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS15 */
#define IFX_P_PDISC_PDIS15_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS15 */
#define IFX_P_PDISC_PDIS15_OFF (15)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS1 */
#define IFX_P_PDISC_PDIS1_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS1 */
#define IFX_P_PDISC_PDIS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS1 */
#define IFX_P_PDISC_PDIS1_OFF (1)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS2 */
#define IFX_P_PDISC_PDIS2_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS2 */
#define IFX_P_PDISC_PDIS2_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS2 */
#define IFX_P_PDISC_PDIS2_OFF (2)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS3 */
#define IFX_P_PDISC_PDIS3_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS3 */
#define IFX_P_PDISC_PDIS3_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS3 */
#define IFX_P_PDISC_PDIS3_OFF (3)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS4 */
#define IFX_P_PDISC_PDIS4_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS4 */
#define IFX_P_PDISC_PDIS4_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS4 */
#define IFX_P_PDISC_PDIS4_OFF (4)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS5 */
#define IFX_P_PDISC_PDIS5_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS5 */
#define IFX_P_PDISC_PDIS5_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS5 */
#define IFX_P_PDISC_PDIS5_OFF (5)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS6 */
#define IFX_P_PDISC_PDIS6_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS6 */
#define IFX_P_PDISC_PDIS6_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS6 */
#define IFX_P_PDISC_PDIS6_OFF (6)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS7 */
#define IFX_P_PDISC_PDIS7_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS7 */
#define IFX_P_PDISC_PDIS7_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS7 */
#define IFX_P_PDISC_PDIS7_OFF (7)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS8 */
#define IFX_P_PDISC_PDIS8_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS8 */
#define IFX_P_PDISC_PDIS8_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS8 */
#define IFX_P_PDISC_PDIS8_OFF (8)

/** \\brief  Length for Ifx_P_PDISC_Bits.PDIS9 */
#define IFX_P_PDISC_PDIS9_LEN (1)

/** \\brief  Mask for Ifx_P_PDISC_Bits.PDIS9 */
#define IFX_P_PDISC_PDIS9_MSK (0x1)

/** \\brief  Offset for Ifx_P_PDISC_Bits.PDIS9 */
#define IFX_P_PDISC_PDIS9_OFF (9)

